# S&P500 Data + Interest Rate Data Unlogged

In [ ]:
# imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# make one final dataset with rate_data and s&p 500 data
df = pd.read_csv("../00_data/sp500_full.csv", parse_dates=["date"])
df2 = pd.read_csv("../00_data/clean_data.csv", parse_dates=["Date"])

In [9]:
df.head()

        date       open       high      low      close
0 2015-12-31  2060.5901  2062.5400  2043.62  2043.9399
1 2015-12-30  2077.3401  2077.3401  2061.97  2063.3601
2 2015-12-29  2060.5400  2081.5601  2060.54  2078.3601
3 2015-12-28  2057.7700  2057.7700  2044.20  2056.5000
4 2015-12-24  2063.5200  2067.3601  2058.73  2060.9900

In [10]:
df2.head()

        Date  3 Mo  6 Mo  1 Yr  2 Yr  3 Yr  5 Yr  7 Yr  10 Yr
0 1990-01-02  7.83  7.89  7.81  7.87  7.90  7.87  7.98   7.94
1 1990-01-03  7.89  7.94  7.85  7.94  7.96  7.92  8.04   7.99
2 1990-01-04  7.84  7.90  7.82  7.92  7.93  7.91  8.02   7.98
3 1990-01-05  7.79  7.85  7.79  7.90  7.94  7.92  8.03   7.99
4 1990-01-08  7.79  7.88  7.81  7.90  7.95  7.92  8.05   8.02

In [11]:
df.rename(columns={"date": "Date"}, inplace=True)
numerical_columns = df.select_dtypes(include=[np.number]).columns.tolist()

# log the columns such that the data isn't skewed
# find better ideas to transform this
df[numerical_columns] = df[numerical_columns]
df.head()

        Date       open       high      low      close
0 2015-12-31  2060.5901  2062.5400  2043.62  2043.9399
1 2015-12-30  2077.3401  2077.3401  2061.97  2063.3601
2 2015-12-29  2060.5400  2081.5601  2060.54  2078.3601
3 2015-12-28  2057.7700  2057.7700  2044.20  2056.5000
4 2015-12-24  2063.5200  2067.3601  2058.73  2060.9900

In [12]:
merged_df = pd.merge(df2, df, on="Date", how="inner")

print(merged_df.head())

        Date  3 Mo  6 Mo  1 Yr  2 Yr  3 Yr  5 Yr  7 Yr  10 Yr    open    high  \
0 1990-01-02  7.83  7.89  7.81  7.87  7.90  7.87  7.98   7.94  353.40  359.69
1 1990-01-03  7.89  7.94  7.85  7.94  7.96  7.92  8.04   7.99  359.69  360.59
2 1990-01-04  7.84  7.90  7.82  7.92  7.93  7.91  8.02   7.98  358.76  358.76
3 1990-01-05  7.79  7.85  7.79  7.90  7.94  7.92  8.03   7.99  355.67  355.67
4 1990-01-08  7.79  7.88  7.81  7.90  7.95  7.92  8.05   8.02  352.20  354.24

      low   close
0  351.98  359.69
1  357.89  358.76
2  352.89  355.67
3  351.35  352.20
4  350.54  353.79

In [13]:
merged_df = merged_df.sort_values(by="Date")

In [14]:
merged_df.to_csv("../00_data/clean_rate_sp500.csv", index=False)